app/controllers/coins_controller.rb

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "mining_type_id" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["mining_type_id", 2], ["updated_at", "2022-06-18 04:14:40.709173"], ["id", 1]]

  def destroy
    @coin.destroy
---
DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 1]]

    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description, :id)
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"